[
  {
    "slug": "stake-engine-announcement",
    "title": "Stake Engine Officially Announced",
    "date": "2025-04-28",
    "excerpt": "Stake unveils Stake Engine — a powerful new game framework for developers, now powering Stake Originals and third-party titles.",
    "cover": "/images/news/StakeEngineNowLive.png",
    "contentHtml": "<p>Stake has officially announced the launch of the <strong>Stake Engine</strong> — a cutting-edge Remote Gaming Server (RGS) designed to power both Stake's Originals and new third-party games. This platform offers developers the same high-performance framework that drives Stake's most popular titles, opening the door to unprecedented creative and technical possibilities.</p><p>With a strong focus on <strong>fairness, scalability, and seamless integration</strong>, Stake Engine gives studios the ability to build, test, and publish games directly to Stake's massive global audience. Developers can leverage its advanced tools, secure infrastructure, and real-time data systems to create engaging experiences that meet Stake's exacting standards.</p><p>Stake Engine also introduces streamlined compliance processes and cross-platform optimization — ensuring games run flawlessly across desktop, mobile, and tablet devices.</p><p>This announcement marks a major step forward in Stake's commitment to fostering innovative, high-quality gaming experiences for players worldwide.</p>"
  },
  {
    "slug": "zeroedge-studios-stake-engine-access",
    "title": "ZeroEdge Studios Secures Stake Engine Access",
    "date": "2025-08-01",
    "excerpt": "We've secured official access to Stake Engine — becoming an exclusive publisher for the Stake platform.",
    "cover": "/images/news/Stake-Engine.jpg",
    "contentHtml": "<p>ZeroEdge Studios is proud to announce that we now have official access to the <strong>Stake Engine</strong> — the same game framework powering Stake's Originals.</p><p>With this milestone, we've also become a <strong>Stake-exclusive publisher</strong>, meaning all of our games will be released directly and exclusively on the Stake platform. This ensures our titles meet Stake's highest standards for performance, fairness, and compliance — while reaching their massive global audience.</p><p>Our development team is already working on our first Stake-exclusive release, and we'll be sharing previews very soon.</p>"
  },
  {
    "slug": "zeroedge-studios-launch",
    "title": "The Official Launch of ZeroEdge Studios",
    "date": "2025-08-02",
    "excerpt": "ZeroEdge Studios officially launches as a Stake-exclusive publisher — bringing innovative and fair slot games to Stake players worldwide.",
    "cover": "/images/news/ZeroEdgeStudios.png",
    "contentHtml": "<p>We're excited to officially launch <strong>ZeroEdge Studios</strong> — a new game studio creating innovative, high-quality slot games exclusively for Stake.</p><p>Following our recent Stake Engine access announcement, we're now positioned to deliver top-tier, transparent, and engaging games directly to Stake's global player base. As a <strong>Stake-exclusive publisher</strong>, every title we release will be fully optimized for the platform's ecosystem.</p><p>This is just the beginning — our first exclusive game is already in development, with more projects lined up. Stay tuned for updates, sneak peeks, and release dates.</p>"
  }
]
